{
  "intro": {
    "heading": "Hi, I’m Dania!",
    "subheading": "Developer + Designer"
  },
  "about": {
    "heading": "About Me",
    "bio": {
      "1": "I’m Dania Alnahdi, a Boston-based frontend developer from Bahrain. I’m interested in web and software development, innovative and human-centered technology, and interactive (and pretty) user interfaces.",
      "2": "I graduated with a BS in Computer Science and Design from <a href='https://www.northeastern.edu' target='_blank' rel='noopener noreferrer'>Northeastern University</a>, and I'm currently pursuing an MS in Innovation and Management at <a href='https://www.tufts.edu/' target='_blank' rel='noopener noreferrer'>Tufts University</a>. Thanks to my academic coursework, industry experience at <a href='https://www.cargurus.com/' target='_blank' rel='noopener noreferrer'>CarGurus</a>, <a href='https://www.asicsdigital.com/' target='_blank' rel='noopener noreferrer'>ASICS Digital</a> and <a href='https://www.mfs.com/en-us/' target='_blank' rel='noopener noreferrer'>MFS</a>, and the numerious internet rabbit holes I tumble into, I’m always exploring new skills from both the development and design worlds.",
      "3": "When I’m not behind my computer, you’ll likely find me advocating for causes I’m passionate about, discovering plant-based food joints, or petting my cat."
    },
    "skills": {
      "code": {
        "1": "JavaScript",
        "2": "React",
        "3": "CSS/SCSS"
      },
      "design": {
        "1": "Figma",
        "2": "Adobe XD",
        "3": "Adobe Illustrator"
      },
      "concepts": {
        "1": "Object-Oriented Design",
        "2": "UX/UI Design",
        "3": "Design Thinking"
      },
      "tools": {
        "1": "Git & GitHub",
        "2": "Full Stack Dev",
        "3": "JAMstack"
      }
    }
  },
  "projects": {
    "heading": "What I've Worked On",
    "project1": {
      "type": "Web App",
      "name": "OneASICS",
      "description": "During my <a href='https://www.asicsdigital.com/' target='_blank' rel='noopener noreferrer'>ASICS Digital</a> co-op, I primarily worked on OneASICS: the authentication portal used across ASICS' fitness and e-commerce apps. My biggest task was updating the registration's interface and error handling logic, decreasing user errors by 37%.",
      "tech": "JS • CSS • Google Optimize"
    },
    "project2": {
      "type": "Website",
      "name": "Personal Website",
      "description": "This very website! My goal was to create a responsive website from scratch using modern JavaScript tooling. I also added my own illustrations for a more personalized feel.",
      "tech": "JS • SCSS • Webpack • Illustrator"
    },
    "project3": {
      "type": "Web App",
      "name": "Build for Black Lives",
      "description": "An online platform that connects Black businesses and organizations to developers and creatives offering pro bono services. I was able to kickstart and collaborate on this initiative as an organizer for <a href='https://hackbeanpot.com/' target='_blank' rel='noopener noreferrer'>HackBeanpot</a>!",
      "tech": "React • Airtable API"
    },
    "project4": {
      "type": "Web App",
      "name": "Eco Eateries",
      "description": "This winning hackathon project is a goal-tracker for restaurants to adopt sustainable business practices. As the only frontend developer on the team, I was in charge of building the user interface, which included an interactive Kanban board.",
      "tech": "React • Python • MySQL"
    },
    "project5": {
      "type": "Web App",
      "name": "Security Council Database",
      "description": "For my database course, my team created a database of United Nations data with the goal of making information on global issues more accessible. To demonstrate our work, I coded and deployed this full-stack, online directory, which included creating an API.",
      "tech": "React • Node.js • MySQL"
    },
    "project6": {
      "type": "Research + Design + Web App",
      "name": "Cubby",
      "description": "My Interaction Design senior capstone: a learning management system designed for students ages 5-7 in remote and hybrid classes. As a developer on my team, I worked on a live, interactive demo showcasing Cubby's primary and most distinguishing features.",
      "tech": "ٍReact • Figma"
    }
  },
  "contact": {
    "heading": "Say hi!",
    "subheading": "Contact me at <a href='mailto:mail@daniaalnahdi.com' target='_top'  rel='noopener noreferrer'>mail@daniaalnahdi.com</a >"
  }
}
